#Область ОбработчикиСобытийЭлементовШапкиФормы

// Ограничивает выбор родительской локации текущей кампанией (Владелец).
//
&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Владелец));

	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

#КонецОбласти
